#### IFCFileReadOptions Members

---

|  |
| --- |
| IFCFileReadOptions Class   Constructors   Methods   Properties   See Also |

The  IFCFileReadOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | IFCFileReadOptions | Creates a default IFCFileReadOptions. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  IFCFileReadOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | FileName | The full file name of the IFC file to be read. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | XMLConfigFileName | The XML configuration file name. It is used only for reading IFC-XML format file. |

# See Also

IFCFileReadOptions Class

Autodesk.Revit.DB.IFC Namespace